mission7/nije/blog/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "2222"], ["commenter", "111"], ["created_at", Tue, 20 Aug 2013 00:20:10 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 20 Aug 2013 00:20:10 UTC +00:00]]
---
	def create
		@post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:commenter, :body))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
	def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy