mission7/nije/blog/app/controllers/posts_controller.rb

	def create
		# render text: params[:post].inspect
	  # @post = Post.new(post_params)

		@post = Post.new(params[:post].permit(:title, :text))

		if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 19 Aug 2013 13:54:28 UTC +00:00], ["text", "123"], ["title", "123"], ["updated_at", Mon, 19 Aug 2013 13:54:28 UTC +00:00]]

	def show
		@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]

	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "12345"], ["text", "12345"], ["updated_at", Tue, 20 Aug 2013 00:13:38 UTC +00:00]]